---
kind: method
id: M:Autodesk.Revit.DB.Structure.AnalyticalModelSelector.#ctor
source: html/81d26278-3a1d-1e9b-90da-9b733c75e9d5.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalModelSelector.#ctor Method

Creates a selector for the analytical model geometry.

## Syntax (C#)
```csharp
public AnalyticalModelSelector()
```

## Remarks
This version is useful for single-curve or single-point analytical models.
 Additionally, this only acts with respect to the entire curve or point.